export const PRIORITY_PROFESSIONS = [
  {
    category: "Уул уурхай, эрдэс баялгийн салбар",
    professions: [
      "Уул уурхайн инженер",
      "Геологич",
      "Инженер геологи, геотехникч",
      "Хүрээлэн буй орчны мэргэжилтэн",
      "Байгаль хамгааллын технологич",
    ],
  },
  {
    category: "Дэд бүтэц, эрчим хүч, зам тээврийн салбар",
    professions: [
      "Цахилгаан эрчим хүчний инженер",
      "Автоматжуулалт, электроникийн инженер",
      "Авто инженер",
      "Мэдээлэл, харилцаа холбооны инженер",
      "Авто тээврийн хяналтын улсын байцаагч",
      "Механик инженер",
      "Механик, төмөрлөгийн инженер",
      "Машин механизмын инженер",
    ],
  },
  {
    category: "Барилга, хот байгуулалтын салбар",
    professions: [
      "Архитектур",
      "Барилгын инженер",
      "Хот төлөвлөлтийн мэргэжилтэн",
      "Газар зохион байгуулалтын инженер",
    ],
  },
  {
    category: "Хүнс, хөдөө аж ахуйн салбар",
    professions: [
      "Агрономич",
      "Малын эмч",
      "Хүнсний үйлдвэрлэлийн технологич",
      "Хөнгөн үйлдвэрийн технологич",
    ],
  },
  {
    category: "Нийгмийн салбар",
    professions: ["Эмч, сувилагч", "Багш"],
  },
];

export const DEMANDED_PROFESSIONS = [
  {
    category: "Эрүүл мэндийн салбар",
    professions: [
      "Их эмч",
      "Сувилагч",
      "Эх баригч",
      "Сэтгэцийн эмч",
      "Дүрс оношилгоо",
    ],
  },
  {
    category: "Боловсролын салбар",
    professions: [
      "Багш, бага боловсрол",
      "Багш, Англи хэл, гадаад хэл",
      "Багш, хөгжмийн боловсрол",
      "Багш, байгалийн ухаан",
      "Багш, дизайн технологи",
      "Багш, Монгол хэл",
      "Сэтгэл зүйч",
      "Хоол зүйч",
    ],
  },
  {
    category: "Дэд бүтэц, эрчим хүч, зам тээврийн салбар",
    professions: [
      "Архитектур",
      "Барилгын инженер",
      "Хот төлөвлөлтийн мэргэжилтэн",
      "Газар зохион байгуулалтын инженер",
    ],
  },
  {
    category: "Хүнс, хөдөө аж ахуйн салбар",
    professions: [
      "Агрономич",
      "Малын эмч",
      "Хүнсний үйлдвэрлэлийн технологич",
      "Хөнгөн үйлдвэрийн технологич",
    ],
  },
];

export const checkIsPriorityProfession = (profession: string) => {
  return PRIORITY_PROFESSIONS.some((group) =>
    group.professions.includes(profession)
  );
};

export const checkIsDemandedProfession = (profession: string) => {
  return DEMANDED_PROFESSIONS.some((group) =>
    group.professions.includes(profession)
  );
};
