export const PRIORITY_PROFESSIONS: { category: string; professions: string[] }[] = [];

export const DEMANDED_PROFESSIONS = [
  {
    category: "01 Боловсрол",
    professions: [
      "Багш, бага боловсрол",
      "Багш, дизайн технологийн боловсрол",
      "Багш, хөгжмийн боловсрол",
      "Багш, гадаад хэлний боловсрол",
      "Багш, физикийн боловсрол",
      "Багш, химийн боловсрол",
      "Багш, биологийн боловсрол",
      "Багш, хоол зүй, шим судлал",
    ],
  },
  {
    category: "02 Урлаг, хүмүүнлэг",
    professions: [
      "График дизайн",
      "Хөгжимдөх урлаг",
      "Дуулах урлаг",
      "Жүжиглэх урлаг",
      "Бүжгийн урлаг",
    ],
  },
  {
    category: "03 Нийгмийн шинжлэх ухаан, мэдээлэл, сэтгүүл",
    professions: [
      "Эдийн засаг",
      "Сэтгэл судлал",
    ],
  },
  {
    category: "06 Мэдээлэл, харилцаа холбооны технологиуд",
    professions: [
      "Өгөгдлийн ухаан",
      "Программ хангамж",
      "Хиймэл оюун ухаан",
    ],
  },
  {
    category: "07 Инженерчлэл, үйлдвэрлэл, барилга байгууламж",
    professions: [
      "Сэргээгдэх эрчим хүч",
      "Дулааны цахилгаан станцын инженерчлэл",
      "Дулааны процессын автоматжуулалт",
      "Дулаан хангамжийн инженерчлэл",
      "Цахилгааны инженерчлэл",
      "Цахилгаан хангамж",
      "Төмөр замын автоматик ба телемеханик, холбоо",
      "Компьютерын инженерчлэл",
      "Программ хангамжийн инженерчлэл",
      "Гагнуурын технологи",
      "Авто инженерчлэл",
      "Нисэх техникийн механик",
      "Төмөр замын машин ашиглалт",
      "Хүнсний чанар, аюулгүй байдал",
      "Уул уурхайн ашиглалтын технологи",
      "Газрын тосны инженерчлэл",
      "Газрын тос боловсруулах үйлдвэрийн инженерчлэл",
      "Газар зохион байгуулалт",
      "Архитектур",
      "Ландшафтын архитектур",
      "Хот ба бүс нутгийн төлөвлөлт",
      "Усан хангамж, ариутгах татуургын инженерчлэл",
      "Сантехникийн инженерчлэл",
      "Барилгын инженерчлэл",
      "Авто замын инженерчлэл",
    ],
  },
  {
    category: "08 Хөдөө аж ахуй, ой, загасны аж ахуй, мал эмнэлзүй",
    professions: [
      "Агрономи",
      "Хөдөө аж ахуйн үйлдвэрийн инженер",
      "Ойн инженерчлэл",
      "Мал эмнэл зүй",
      "Уламжлалт анагаах ухааны эмийн ургамал судал",
    ],
  },
  {
    category: "09 Эрүүл мэнд, нийгмийн хамгаалал",
    professions: [
      "Анагаах ухаан /их эмч/",
      "Сувилахуй",
      "Эх барихуй",
      "Дүрс оношилгооны технологи",
      "Уламжлалт анагаах ухаан",
      "Уламжлалт анагаахын засал",
      "Нийгмийн эрүүл мэнд",
    ],
  },
  {
    category: "10 Үйлчилгээ",
    professions: [
      "Хөдөлмөрийн аюулгүй байдал, эрүүл ахуй",
      "Төмөр замын тээврийн удирдлага, зохион байгуулалт",
    ],
  },
];

export const checkIsPriorityProfession = (profession: string) => {
  return PRIORITY_PROFESSIONS.some((group) =>
    group.professions.includes(profession)
  );
};

export const checkIsDemandedProfession = (profession: string) => {
  return DEMANDED_PROFESSIONS.some((group) =>
    group.professions.includes(profession)
  );
};
